{
  "NAVBAR": {
    "HOME": "Home",
    "ABOUT": "About",
    "TECHNOLOGIES": "Technologies",
    "PROJECTS": "Projects",
    "CONTACT": "Contact"
  },
  "HOME": {
    "DESCRIPTION": "Welcome to my portfolio. I am a developer who is not afraid of new challenges and loves learning new things.",
    "PROJECTS_BUTTON": "My Projects",
    "CONTACT_BUTTON": "Contact Me"
  },
  "ABOUT": {
    "TITLE": "ABOUT ME",
    "DESCRIPTION": "Welcome to my personal page! Here, you can learn more about my background, hobbies, and experiences.",
    "BIOGRAPHY": {
      "TITLE": "Biography",
      "DESCRIPTION": "I was born in February 2003 in Žatec. I attended primary school there and later enrolled at the Secondary Industrial School in Chomutov, where I majored in Automation Systems. After successfully passing my matriculation exams, I continued my studies at the Faculty of Applied Sciences at the University of West Bohemia in Pilsen, where I am currently pursuing a degree in Informatics."
    },
    "HOBBIES": {
      "TITLE": "Hobbies",
      "DESCRIPTION": "My hobbies include going to the gym, spending time with friends, listening to music, playing the guitar, and enjoying night drives."
    },
    "PETS": {
      "TITLE": "Pets",
      "DESCRIPTION": "I live with two cats, Lucifer and Foxy. Additionally, there is a hamster named Šmudlina living in Žatec."
    },
    "WORK" : {
      "TITLE": "Work Experience",
      "DESCRIPTION": "Since April 2024, I have been working as a Trainee in the student lab at Eurosoftware S.R.O."
    }
  },
  "TECHNOLOGIES": {
    "TITLE": "TECHNOLOGIES",
    "LANGUAGES": "Programming Languages",
    "FRAMEWORKS": "Frameworks & Libraries",
    "TOOLS": "Tools & Platforms"
  },
  "PROJECTS": {
    "TITLE": "PROJECTS",
    "DESCRIPTION": "Here you can find a selection of my projects. Click on the project to learn more about it.",
    "MODAL": {
      "VIEW": "View Project",
      "NO_LINK": "No link available"
    }
  },
  "CONTACT": {
    "TITLE": "CONTACT ME",
    "DESCRIPTION": "Feel free to reach out to me! You can use the form below to send me a message or contact me through my social media profiles.",
    "FORM": {
      "NAME": "Your Name",
      "EMAIL": "Your Email",
      "MESSAGE": "Your Message",
      "SUBMIT": "Submit"
    }
  },
  "FOOTER": {
    "COPYRIGHT": "All rights reserved"
  }
}
